---
kind: type
id: T:Autodesk.Revit.DB.ParameterMap
source: html/ff69bcfe-2531-e9dd-279d-e1095c035e19.htm
---
# Autodesk.Revit.DB.ParameterMap

A map that can contain a mapping of a parameter name (a String) to a parameter.

## Syntax (C#)
```csharp
public class ParameterMap : APIObject,
	IEnumerable
```